syabyr/efr32_proj/lis3dh/src/InitDevice.c
}

//================================================================================
// PCNT0_enter_DefaultMode_from_RESET
//================================================================================
extern void PCNT0_enter_DefaultMode_from_RESET(void) {

	// $[PCNT0 I/O setup]
	// [PCNT0 I/O setup]$

	// $[PCNT0 initialization]
	// [PCNT0 initialization]$

}

//================================================================================
// PRS_enter_DefaultMode_from_RESET
//================================================================================
extern void PRS_enter_DefaultMode_from_RESET(void) {

	// $[PRS initialization]
	// [PRS initialization]$

}

//================================================================================
// PORTIO_enter_DefaultMode_from_RESET
//================================================================================
extern void PORTIO_enter_DefaultMode_from_RESET(void) {

	// $[Port A Configuration]

	/* Pin PA0 is configured to Open-drain with pull-up and filter */
	GPIO_PinModeSet(gpioPortA, 0, gpioModeWiredAndPullUpFilter, 0);

	/* Pin PA1 is configured to Open-drain with pull-up and filter */
	GPIO_PinModeSet(gpioPortA, 1, gpioModeWiredAndPullUpFilter, 0);
	// [Port A Configuration]$

    // $[Port B Configuration]

    /* Pin PB11 is configured to Push-pull */
    GPIO_PinModeSet(gpioPortB, 11, gpioModePushPull, 0);

    /* Pin PB14 is configured to Input enabled */
    GPIO_PinModeSet(gpioPortB, 14, gpioModeInput, 0);

    /* Pin PB15 is configured to Push-pull */
    GPIO_PinModeSet(gpioPortB, 15, gpioModePushPull, 0);
    // [Port B Configuration]$

    // $[Port C Configuration]

    /* Pin PC10 is configured to Input enabled with pull-up */
    GPIO_PinModeSet(gpioPortC, 10, gpioModeInputPull, 1);
    // [Port C Configuration]$

    // $[Port D Configuration]

    /* Pin PD13 is configured to Push-pull */
    GPIO_PinModeSet(gpioPortD, 13, gpioModePushPull, 0);

    /* Pin PD14 is configured to Input enabled */
    GPIO_PinModeSet(gpioPortD, 14, gpioModeInput, 0);

    /* Pin PD15 is configured to Push-pull */
    GPIO_PinModeSet(gpioPortD, 15, gpioModePushPull, 0);
    // [Port D Configuration]$

    // $[Port E Configuration]
    // [Port E Configuration]$

    // $[Port F Configuration]
    // [Port F Configuration]$

}

